{
  "tickets": [
    {
      "title": "Property Planner Mortgage UI Shell",
      "description": "Document the mortgage wizard UI that now anchors the Property Planner experience so downstream teams know what has already shipped and what data contracts it expects.",
      "technicalDetails": [
        "Mortgage wizard renders responsive cards, inputs, and charts (loan balance line + interest/principal bars) inside `components/property-planner/mortgage-wizard.tsx` with dynamic heights and inline scenario naming.",
        "Planner shell (`components/property-planner/property-planner-shell.tsx`) lets users edit the \"Currently modeling\" description per property type without losing defaults.",
        "Charts share amortization data derived on the client, include labeled axes, and stretch to ~28% viewport height for readability.",
        "UI state is still mock-driven via `PROPERTY_PLANNER_MOCKS` but is wired to `useFinancialPlanningStore` for monthly income and projections.",
        "Spec captures the UX contract (cards shown, helper text, empty-state messaging) so backend schemas can mirror the required fields."
      ],
      "acceptanceCriteria": [
        "Mortgage wizard section displays the inputs, overview cards, and dual charts exactly as seen in the latest UI build.",
        "Scenario headline is editable inline while retaining scenario-specific defaults per property type.",
        "Charts expand responsively, show evenly spaced year ticks, and display the new crimson/blue palette.",
        "Spec clearly states that data is mocked today and will be replaced once persistence APIs land.",
        "Ticket acts as documentation only (no further engineering work required)."
      ],
      "storyPoints": 1,
      "difficulty": "low",
      "tags": ["property", "frontend", "documentation"],
      "id": "T30A-FE-PROPERTY-SHELL",
      "status": "done"
    },
    {
      "title": "Property Planner Scenario Persistence",
      "description": "Introduce backend persistence so mortgage planner inputs (loan terms, amortization snapshots, scenario metadata) survive reloads and sync between chat + dashboard.",
      "technicalDetails": [
        "Add Go service endpoints for property planner scenarios (create/update/get/list) storing: property type, editable headline/location, loan inputs, amortization timeline, overview metrics.",
        "Extend `FinancialClient` with `/property-planner` resource client and wire `MortgageWizard` to load/save via Zustand store instead of static mocks.",
        "Add database migrations for planner scenario tables keyed by user + property type with JSONB fields for amortization arrays.",
        "Persist scenario updates on every user change with debounce + optimistic updates; fall back to cache on offline errors.",
        "Expose `/api/property-planner` Next route that proxies to Go service and enforces auth.",
        "Cover new endpoints with unit tests plus contract tests to ensure amortization payload matches frontend expectations."
      ],
      "acceptanceCriteria": [
        "User edits to planner inputs save automatically and reload on refresh/device change.",
        "At most one scenario per property type is stored per user, but backend supports future multi-scenario expansion.",
        "MortgageWizard reads from live data when available and falls back to mocks only when user has no saved scenario.",
        "APIs include validation + error handling, with optimistic UI rollback when persistence fails.",
        "Test suite verifies CRUD operations and serialization of amortization/timeline data."
      ],
      "storyPoints": 5,
      "difficulty": "medium",
      "tags": ["property", "backend", "persistence", "go"],
      "id": "T30B-BE-PROPERTY-PERSISTENCE",
      "status": "done"
    },
    {
      "title": "Property Planner Save/Apply Actions",
      "description": "Wire the Save Draft and Apply to Plan buttons so users control when planner scenarios persist and when data syncs into the financial plan.",
      "technicalDetails": [
        "Only persist scenario changes to `/property-planner` APIs when the Save Draft button is pressed; live typing should stay local until saved.",
        "Apply to Plan should take the current mortgage snapshot and write/update a matching liability entry plus a recurring income/expense entry reflecting the monthly repayment.",
        "Expose a dedicated backend endpoint (or flag on existing planner API) that performs the liability + cashflow mutations atomically.",
        "Update the Zustand store/UI to show loading/confirmation states for both buttons.",
        "Persist last-saved timestamps so the UI can show when the draft was stored.",
        "When liabilities/expenses are created from Apply to Plan, include a small icon/button on those cards that reopens the property planner modal for quick edits." 
      ],
      "acceptanceCriteria": [
        "Autosave is disabled; planner inputs only hit the backend when Save Draft is pressed.",
        "Save Draft stores the scenario and shows a success indicator; dismissing/reopening reflects the saved values.",
        "Apply to Plan creates/updates the mortgage liability and adds the mortgage repayment to the net worth/ cashflow cards.",
        "API operations are transactional—either both liability + repayment entries succeed or the UI rolls back with an error message.",
        "Buttons handle concurrent presses gracefully (debounce + disabled state).",
        "Liability and cashflow entries created by Apply to Plan display a planner icon that opens the Property Planner modal when clicked."
      ],
      "storyPoints": 5,
      "difficulty": "medium",
      "tags": ["property", "backend", "frontend"],
      "id": "T30B-FE-BE-PROPERTY-SAVE-ACTIONS",
      "status": "done"
    },
    {
      "title": "Chat-Controlled Property Planner CRUD",
      "description": "Allow users to create, update, and clear property planner scenarios through the chat intent pipeline so both UI and conversational surfaces stay in sync.",
      "technicalDetails": [
        "Extend `lib/intent/llm.ts` prompts + schema to recognize property planner entities (scenario, loan amount, tenure, location) and verbs for `add-item`, `update`, `remove-item` similar to assets/liabilities.",
        "Map new property planner intent actions inside `dispatchIntentActions` (or a dedicated dispatcher) so confirmed intents persist via the property planner APIs introduced in T30B.",
        "Add guardrails so property planner actions only trigger when user references property calculator terms, preventing accidental conflicts with general assets.",
        "Update `AGENTS.md`/docs to describe the chat commands (e.g., \"Set mortgage planner loan amount to 800k\", \"Rename the scenario to Tampines North BTO\").",
        "Instrument analytics/audit events for planner CRUD similar to existing `/api/actions` payloads.",
        "Create integration tests that issue sample chat commands and assert planner store + backend data changes."
      ],
      "acceptanceCriteria": [
        "Users can ask chat to change planner values (loan amount, tenure, rates, scenario name) and the UI updates without manual refresh.",
        "Chat can create an initial planner scenario when none exists and can remove/reset it on request.",
        "Intent parser emits well-typed actions for planner fields alongside existing financial entities.",
        "Dispatcher gracefully handles validation errors (e.g., invalid tenure) and surfaces clear chat responses.",
        "Tests cover add/update/remove flows ensuring planner data stays consistent across chat + dashboard."
      ],
      "storyPoints": 5,
      "difficulty": "medium",
      "tags": ["property", "chat", "backend", "frontend"],
      "id": "T30C-FE-BE-PROPERTY-CHAT",
      "status": "done"
    },
    {
      "title": "Chat + Dashboard Responsive Layout",
      "description": "Ensure the main chat + dashboard view gracefully reflows when horizontal space is limited so financial widgets remain accessible on smaller breakpoints.",
      "technicalDetails": [
        "Updated `app/(chat)/page.tsx` to keep the chat panel width constrained on large screens while allowing the workspace/data column to stretch or stack vertically on mobile.",
        "Added `min-w-0`/`min-h-0` safeguards on the workspace cards so charts and grids shrink without overflowing or causing fixed-width scrollbars.",
        "Removed the `lg:hidden` wrapper that previously hid the financial workspace/data sections on narrow viewports, enabling full CRUD access regardless of device size.",
        "Financial data cards now include `min-w-0` guards and flex wrapping so headers, buttons, and currency amounts flow onto new lines instead of forcing a horizontal scrollbar."
      ],
      "acceptanceCriteria": [
        "Reducing the browser width stacks the Financial Workspace and Financial Data panels beneath the chat instead of clipping them.",
        "No horizontal scrollbar appears purely from layout containers at common breakpoints (sm/md/lg).",
        "Charts and data cards stay readable by flexing their width while respecting rounded borders and padding.",
        "Rows inside the Financial Data cards wrap their trailing buttons/amounts below the title on very small widths without overlapping."
      ],
      "storyPoints": 1,
      "difficulty": "low",
      "tags": ["frontend", "responsiveness"],
      "id": "T45-FE-RESPONSIVE-LAYOUT",
      "status": "done"
    },
    {
      "title": "Floating Chat Launcher",
      "description": "Expose the AI chat via a floating launcher on small screens while keeping the dedicated chat column on desktop so both experiences feel native.",
      "technicalDetails": [
        "Created `components/chat-floating-launcher.tsx` which renders a fixed bottom-right button and a compact modal that keeps the `Chat` component mounted while toggling visibility.",
        "Reworked `app/(chat)/page.tsx` so the chat column remains visible on `lg` breakpoints while the floating launcher is only rendered on smaller widths.",
        "The launcher uses transition styles, focus-visible rings, and dedicated close controls to keep the experience accessible."
      ],
      "acceptanceCriteria": [
        "On desktop (lg and above), the chat column is permanently visible beside the dashboard widgets.",
        "On tablet/mobile widths, chat is hidden until the user clicks the floating button at the bottom right.",
        "Clicking the button opens a small modal/panel containing the existing chat interface and can be toggled closed via the same button or the inline close control."
      ],
      "storyPoints": 2,
      "difficulty": "low",
      "tags": ["frontend", "chat", "ux"],
      "id": "T46-FE-CHAT-LAUNCHER",
      "status": "done"
    }
  ]
}
